In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import os
import datetime as dt

In [7]:
# Set the directory where your CSV files are located
directory = "./Resources"

# List of CSV files in the directory
csv_files = [file for file in os.listdir(directory) if file.endswith('.csv')]

# Iterate over each CSV file
for file in csv_files:
    # Read the CSV file into a DataFrame
    df = pd.read_csv(f'./Resources/{file}')
    
    # Extract the name of the file without the extension
    file_name = os.path.splitext(file)[0]
    
    # Create a new column with the name of the file
    df['File Name'] = file_name
    
    # Write the DataFrame back to a new CSV file with the updated column
    df.to_csv(f'./Updated_Resources/{file_name}_with_name_column.csv', index=False)

In [8]:
# Set the directory where your CSV files are located
directory = "./Updated_Resources"

# Get a list of all CSV files in the directory
files = [file for file in os.listdir(directory) if file.endswith('.csv')]

# Read each CSV file into a DataFrame and concatenate them into one DataFrame
dfs = [pd.read_csv(os.path.join(directory, file)) for file in files]
combined_df = pd.concat(dfs)

# Write the combined DataFrame to a new CSV file
combined_df.to_csv('./Updated_Resources/combined.csv', index=False)

/var/folders/hd/l4stjqk14jn9smh667z71gsw0000gn/T/ipykernel_46267/1080102819.py:9: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  combined_df = pd.concat(dfs)

In [11]:
# Read back in the combined csv file with all the data
file_path = './Updated_Resources/combined.csv'
combined_df = pd.read_csv(file_path,encoding='utf-8')

# Adjust name of File Name to Ticker for ease of use
combined_df = combined_df.rename(columns={'File Name':'Ticker'})

# Display first 5 of dataframe
combined_df.head()

,Date,Open,High,Low,Close,Adj Close,Volume,Ticker
0,1993-03-12,2.291667,2.750000,2.250000,2.645833,2.357914,28573200,INTU
1,1993-03-15,2.687500,2.708333,2.583333,2.614583,2.330065,6580800,INTU
2,1993-03-16,2.583333,2.625000,2.520833,2.552083,2.274366,3928800,INTU
3,1993-03-17,2.520833,2.562500,2.416667,2.458333,2.190818,3170400,INTU
4,1993-03-18,2.520833,2.541667,2.458333,2.541667,2.265083,735600,INTU

In [21]:
# Examine data type of each column
combined_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 524382 entries, 0 to 524381
Data columns (total 8 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Date       524382 non-null  object
 1   Open       524382 non-null  float64
 2   High       524382 non-null  float64
 3   Low        524382 non-null  float64
 4   Close      524382 non-null  float64
 5   Adj Close  524382 non-null  float64
 6   Volume     524382 non-null  int64
 7   Ticker     524382 non-null  object
dtypes: float64(5), int64(1), object(2)
memory usage: 32.0+ MB

In [22]:
# Change data types for data analysis
combined_df['Date'] = combined_df['Date'].astype('datetime64[ns]')

In [23]:
# Confirm type changes were successful by examining data types again
combined_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 524382 entries, 0 to 524381
Data columns (total 8 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Date       524382 non-null  datetime64[ns]
 1   Open       524382 non-null  float64
 2   High       524382 non-null  float64
 3   Low        524382 non-null  float64
 4   Close      524382 non-null  float64
 5   Adj Close  524382 non-null  float64
 6   Volume     524382 non-null  int64
 7   Ticker     524382 non-null  object
dtypes: datetime64[ns](1), float64(5), int64(1), object(1)
memory usage: 32.0+ MB

In [26]:
# Created a column for the year to use in future analysis
combined_df['Year'] = combined_df['Date'].dt.year
combined_df

,Date,Open,High,Low,Close,Adj Close,Volume,Ticker,Year
0,1993-03-12,2.291667,2.750000,2.250000,2.645833,2.357914,28573200,INTU,1993
1,1993-03-15,2.687500,2.708333,2.583333,2.614583,2.330065,6580800,INTU,1993
2,1993-03-16,2.583333,2.625000,2.520833,2.552083,2.274366,3928800,INTU,1993
3,1993-03-17,2.520833,2.562500,2.416667,2.458333,2.190818,3170400,INTU,1993
4,1993-03-18,2.520833,2.541667,2.458333,2.541667,2.265083,735600,INTU,1993
...,...,...,...,...,...,...,...,...,...
524377,2024-04-17,342.000000,346.450012,341.239990,344.859985,344.859985,2147800,LULU,2024
524378,2024-04-18,346.500000,352.100006,344.309998,347.510010,347.510010,2180200,LULU,2024
524379,2024-04-19,346.959991,353.100006,346.390015,352.470001,352.470001,2464600,LULU,2024
524380,2024-04-22,354.679993,364.630005,354.679993,361.790009,361.790009,2537800,LULU,2024
524381,2024-04-23,362.170013,366.190002,359.329987,364.679993,364.679993,1549700,LULU,2024

In [31]:
# Creata a groupby the the total of each ticker by year
total_volume_per_year = combined_df.groupby(['Ticker', 'Year'])['Volume'].sum()
total_volume_per_year

Ticker  Year
AAPL    1980     1344851200
        1981     8196944000
        1982    21365008000
        1983    44513011200
        1984    41979033600
                   ...
WDC     2020     1477520400
        2021     1062526500
        2022     1063795700
        2023     1074478200
        2024      543843800
Name: Volume, Length: 2166, dtype: int64